//
//  HDPurcheseMianZeViewController.m
//  HDStock
//
//  Created by hd-app01 on 16/12/23.
//  Copyright © 2016年 hd-app02. All rights reserved.
//

#import "HDPurcheseMianZeViewController.h"

@interface HDPurcheseMianZeViewController () {
    NSArray * fengXianMianZeArr;
    NSArray * gouMaiXieYiArr;
    UIScrollView * sc;
}

@end

@implementation HDPurcheseMianZeViewController

- (void)viewDidLoad {
    [super viewDidLoad];
    
    [self setUp];
    
    [self createUI];
}

- (void) createUI {
    sc = [[UIScrollView alloc] initWithFrame:CGRM(0, 0, SCREEN_WIDTH, SCREEN_HEIGHT-NAV_STATUS_HEIGHT)];
    sc.backgroundColor = BACKGROUNDCOKOR;
    [self.view addSubview:sc];
    
    if (self.comeFromIndex == 1) {
        //风险揭示
        [self createFengXianUI];
    }else if (self.comeFromIndex == 2){
        //协议
        [self createXieYiUI];
    }
}
- (void) createFengXianUI {
    for (int i = 0; i < fengXianMianZeArr.count; i++) {
        //内容标签最大size
        CGSize textMaxSize = CGSizeMake([UIScreen mainScreen].bounds.size.width-8*2, MAXFLOAT);
        //内容标签真实坐标（宽，高）
        CGRect textRect = [fengXianMianZeArr[i] boundingRectWithSize:textMaxSize options:NSStringDrawingUsesLineFragmentOrigin attributes:@{NSFontAttributeName:[UIFont systemFontOfSize:13]} context:nil];
        UILabel * tempLabel = [ZHFactory createLabelWithFrame:CGRectZero andFont:[UIFont systemFontOfSize:13] andTitleColor:[UIColor colorWithHexString:@"#666666"] title:fengXianMianZeArr[i]];
        tempLabel.tag = 300 + i;
        tempLabel.numberOfLines = 0;
        tempLabel.textAlignment = NSTextAlignmentLeft;
        [sc addSubview:tempLabel];

        if (i == 0) {
            tempLabel.textAlignment = NSTextAlignmentCenter;
            tempLabel.frame = CGRM(8, 15, SCREEN_WIDTH-8*2, textRect.size.height);
        }else if (i == 2) {
            UILabel * frontLabel = [sc viewWithTag:300+i-1];
            tempLabel.frame = CGRM(8, CGMAX_Y(frontLabel.frame), SCREEN_WIDTH-8*2, textRect.size.height);
        }else {
            UILabel * frontLabel = [sc viewWithTag:300+i-1];
            tempLabel.frame = CGRM(8, CGMAX_Y(frontLabel.frame)+15, SCREEN_WIDTH-8*2, textRect.size.height);
        }
        if (i == fengXianMianZeArr.count-1) {
            sc.contentSize = CGSizeMake(SCREEN_WIDTH, CGMAX_Y(tempLabel.frame)+5);
        }
    }
}
- (void) createXieYiUI {
    for (int i = 0; i < gouMaiXieYiArr.count; i++) {
        //内容标签最大size
        CGSize textMaxSize = CGSizeMake([UIScreen mainScreen].bounds.size.width-8*2, MAXFLOAT);
        //内容标签真实坐标（宽，高）
        CGRect textRect = [gouMaiXieYiArr[i] boundingRectWithSize:textMaxSize options:NSStringDrawingUsesLineFragmentOrigin attributes:@{NSFontAttributeName:[UIFont systemFontOfSize:13]} context:nil];
        UILabel * tempLabel = [ZHFactory createLabelWithFrame:CGRectZero andFont:[UIFont systemFontOfSize:13] andTitleColor:[UIColor colorWithHexString:@"#666666"] title:gouMaiXieYiArr[i]];
        tempLabel.tag = 300 + i;
        tempLabel.numberOfLines = 0;
        tempLabel.textAlignment = NSTextAlignmentLeft;
        [sc addSubview:tempLabel];
        
        if (i == 0) {
            tempLabel.frame = CGRM(8, 15, SCREEN_WIDTH-8*2, textRect.size.height);
        }else {
            UILabel * frontLabel = [sc viewWithTag:300+i-1];
            tempLabel.frame = CGRM(8, CGMAX_Y(frontLabel.frame)+15, SCREEN_WIDTH-8*2, textRect.size.height);
        }
        if (i == gouMaiXieYiArr.count-1) {
            sc.contentSize = CGSizeMake(SCREEN_WIDTH, CGMAX_Y(tempLabel.frame)+5);
        }
    }
}
- (void) setUp {
    if (self.comeFromIndex == 1) {
        self.title = @"风险揭示书";
        fengXianMianZeArr = @[@"《第三方风险揭示书及产品购买协议》",
                              @"尊敬的投资者：",
                              @" 为了使您充分了解证券投资顾问业务的风险，湖南巨景证券投资顾问有限公司四川分公司（以下简称“我公司”）依据《证券投资顾问业务暂行规定》面向投资者提供《证券投资顾问业务风险揭示书》，以便充分揭示证券投资顾问产品（以下简称“本产品”）中所存在的风险或潜在风险。本《风险揭示书》作为《产品购买协议》的附件，对您具有法律约束力。请您务必审慎阅读、充分理解各条款内容。如果您确认购买本产品，表示本揭示书的所有内容您已阅读并完全理解与接受。",
                              @" 一、在您购买本产品前，必须了解提供服务的机构是否具备证券投资咨询业务资格。我公司具有中国证监会颁发的证券投资咨询业务资格，是国内专业投资咨询公司之一。有关信息可在中国证券业协会网站（www.sac.net.cn)查询确认。",
                              @"二、在您购买本产品前，须知悉本产品的投资顾问服务业务仅限于以下业务范畴：向您提供涉及证券及证券相关产品的投资建议服务，辅助您作出投资决策，其中投资建议服务内容包括投资的品种选择、投资组合以及理财规划建议等。您务必重点注意：在您购买本产品后需自主作出投资决策，并独立承担投资风险。",
                              @"三、在您购买本产品前，须知悉本产品提供的证券投资顾问服务不能确保投资者获得盈利（不承诺或者保证投资收益）或本金不受损失。您对自身的风险承受能力应有合理的预估，并独立作出投资决策，避免发生重大无法承受的风险。",
                              @"四、在您购买本产品前，须充分了解本产品提供的投资建议具有针对性和时效性的原则，其投资建议不能在任何市场环境下长期有效。",
                              @"五、在您购买本产品前，须充分了解本产品所依据的证券研究报告和投资分析意见等，可能存在不准确、不全面或者被误读的风险，本产品应当向您说明证券研究报告的发布人和发布时间以及投资分析意见的来源，以便于您在进行投资决策时做出理性判断。",
                              @"六、在您购买本产品前，须充分了解本产品的服务收费标准和方式，按照公平、合理、自愿的原则购买本产品。",
                              @"七、如您发现我公司存在违法违规行为或利益冲突情形，如泄露客户投资决策计划信息、传播虚假信息、进行关联交易等，您有权向我公司的投诉部门举报。",
                              @"八、我公司可能存在因停业、解散、撤销、破产，或者被中国证监会撤销相关业务许可、责令停业整顿等原因导致不能履行职责的风险。",
                              @"九、您需要向我公司提供有效的联系方式和服务获取方式，如有变动须及时提前书面进行说明，如因您未正确填写联系方式及服务获取方式变动情况，或因自身原因或不可抗力因素导致您未能及时获取本产品的服务，不利后果将由您自行承担。",
                              @"十、在您购买本产品时，请保管好自己的证券账户、资金账户和相应的密码，不得委托任何人员管理您的证券账户、资金账户，代理买卖证券，否则由此导致的风险将由您自行承担。 ",
                              @"十一、在您购买本产品前，请务必了解其实际功能、信息来源、固有缺陷和使用风险。由于您自身原因导致使用不当或受到病毒入侵、黑客攻击等不良影响的，由此导致的风险将由您自行承担。本产品具有选择证券投资品种和提示买卖时机的功能，请您认真了解。",
                              @" 十二、本产品违反《产品购买协议》及本《风险揭示书》之约定，擅自所做的承诺一律无效，由此导致的不利后果由您自行承担。我公司证券投资顾问人员或其他人员违反《产品购买协议》及《风险揭示书》之约定，擅自所做的承诺一律无效，由此导致的不利后果由您自行承担。若有人员冒充我公司或者我公司员工的名义与您取得联系，与您签订证券投资收益保证、利益共享或者损失分担等协议或达成其他形式的约定，该类协议或约定我公司一律不予认可，造成您的损失，我公司不予赔偿，您可依法向该等个人追究法律责任。鉴于我公司已做了充分的提示，您确认我公司在此情形发生后得以免责。",
                              @"十三、本风险揭示书的揭示事项仅为列举性质，未能详尽列明您购买本产品所面临的全部风险和可能投资失利的所有因素，请您务必切记自行作出投资决策。 您在购买本产品前，应认真阅读并理解相关业务规则、产品购买协议及本风险揭示书的全部内容。 关于购买本产品的您，需要自行承担投资风险，我公司不以任何方式向您承诺或者保证投资收益，也不会保证您的投资不发生损失。我们的风险提示能力是有限的，敬请理解。"];
    }else if (self.comeFromIndex == 2){
        self.title = @"证券投资咨询会员服务合同";
        gouMaiXieYiArr = @[@"湖南巨景证券投资顾问有限公司四川分公司（以下简称“我公司”）提醒您：在购买本产品前，请务必仔细阅读并完全理解和认可本协议，特别是免除或限制责任的条款。您可以选择不购买本产品，但如果购买本产品，将被视为您足够了解并愿意与我公司达成以下协议。",
                           @"1.购买须知",
                           @"1.1您必须保证您具有签订及履行本协议义务所需的完全民事权利能力和完全民事行为能力，能够承担相应的责任。若您是未成年人，您应在法定监护人陪同下审阅。如果您已婚的，您签署及履行本协议的行为已获配偶的事先同意。",
                           @"1.2本产品仅为您提供参考，由您自行决定是否采用。根据本产品所作出的决定而造成的损失，由您自行承担。",
                           @"2.产品内容",
                           @"本产品向您提供涉及证券及证券相关产品的投资建议服务，辅助您做出投资决策。产品内容包括但不限于投资的品种选择、投资组合、理财规划建议、投资参考、专业技术、教育培训、证券投资知识。在本协议有效期内，本产品向您提供前述服务的一种或多种。本产品不保证通过第三方服务商提供信息的安全性、准确性、有效性、及时性及其他不确定的风险，由此引发的任何争议与损害，与我公司无关，我公司不承担责任。",
                           @"3.权利义务",
                           @"3.1本协议有效期内，您有权按照协议规定，享受本产品提供的咨询意见和投资建议服务。未经我公司同意，不得转让其在本协议下的任何权利义务，不得将通过本协议获取的服务与第三方分享。",
                           @"3.2本产品会全面、客观和及时地向您提供相关信息、文件、资料，您应如实准确的完成我公司对您进行的风险评估，以便我公司在评估您风险承受能力和服务需求的基础上，向您提供投资建议服务。",
                           @"3.3您应提供有效的个人信息和联系方式。如因个人信息和联系方式有误，或因您的自身原因、不可抗力导致您未能及时获取本产品服务，不利后果由您自行承担。",
                           @"3.4您有权决定是否采用本产品提供的咨询意见和投资建议。您必须基于独立判断，自行决定证券投资，并承担相应的投资风险和损失。",
                           @"3.5您应妥善保管本产品账户和相应的密码，不得委托第三方保管账户，代理操作。如因第三方原因导致损失的，与我公司无关。",
                           @"3.6本产品中若出现“预期收益”、“收益或达”等字样，并非本产品承诺或保证收益，仅为可能收益，由此导致的不利后果由您自行承担。",
                           @"3.7您应妥善保管本产品提供的终端工具或平台的用户账号和密码，因您的个人原因或其他非本产品过错导致您的账号和密码泄露而造成经济损失的，我公司不承担责任。",
                           @"3.8我公司享有所提供的本产品的所有权、知识产权及其他相关权利，未经我公司书面许可，您不得进行模仿、复制、传播、转发或以任何其他方式提供给其他第三方,该等违约情形一经发现，我公司有权要求您按照产品费用的1倍支付违约金。",
                           @"4.禁止行为",
                           @"4.1我公司对因提供本产品而知悉的您的个人财产状况等其他个人资料负有保密义务，未经您事先书面许可或未通过本产品程序确认同意，不会向第三方提供。但因监管机关要求及司法需要等原因除外。",
                           @"4.2我公司不会以虚假信息、市场传言或者内部信息为依据向您提供投资分析、预测或建议。",
                           @"4.3我公司不得代理您进行证券买卖和操作，或者替您做出投资决策。",
                           @"4.4我公司不得约定分享投资收益或分担损失，也不得以任何方式对您承诺或保证证券投资收益。",
                           @"5.声明与保证",
                           @"5.1您声明与保证：",
                           @"5.1.1您充分理解投资可能需要承担的风险并有相应的风险承担能力，无论该风险为已有风险或潜在风险。",
                           @"5.1.2您已仔细阅读并完全理解和认可我公司提供的《风险揭示书》（本协议附件）、免责声明等文件，理解投资可能需要承担的风险并有相应的风险承担能力。无论该风险为已有风险或潜在风险。",
                           @"5.1.3您承诺在进行证券投资之前已经对证券交易规则、证券交易惯例、证券交易知识、所投资的证券产品有了一定的了解，并完全知悉证券投资过程中可能蕴含的亏损风险与盈利机会，并已充分理解证券市场“买者自负”的含义，愿意遵守“买者自负”原则。",
                           @"5.1.4您进行任何投资，包括投资判断及决策，并不依赖于本产品提供的建议、方案、报告或相关信息，而是在本产品的付诸下，经过深思熟虑作出独立判断及决策。",
                           @"5.1.5您有责任对本产品提供的服务及投资风险做出独立的判断、决策，您根据本产品提供的建议、方案所做出的决定而导致的损失，由您自行承担。",
                           @"5.1.6您根据本产品中投资顾问服务及软件工具、终端设备载体所提供的所有信息数据以及观点、投资建议、投资分析等资料操作而造成必然或偶然的损失，由您自行承担。",
                           @"5.1.7您已仔细阅读本协议条款，不存在重大误解情况。",
                           @"5.2乙方声明与保证：",
                           @"我公司是根据中国法律依法设立并有效存续的公司，具有签订并履行本协议义务所需的能力及合法授权。",
                           @"6.风险提示和免责条款",
                           @"6.1我公司向您提供本产品，需要以软件工具或者终端设备为载体。您在使用本产品前应仔细阅读相关说明，知悉并了解其实际功能、信息来源、固有缺陷和使用风险，由于您自身原因导致该产品、终端设备等使用不当或受到病毒入侵、黑客攻击等不良影响的，由此导致的风险将由您自行承担。",
                           @"6.2我公司提供本产品：在我公司知情的范围内，我公司以及财产上的利害关系人与所评价的证券没有任何利害关系。由于证券技术分析本身固有的局限性，设备载体提示会随时间和股票价格变动而动态更新。此功能不构成任何投资和股票买卖的建议或依据，您据此操作，风险自担。",
                           @"6.3您应综合考虑投资风险并进行风险控制，由于您忽略风险控制而造成的任何损失，我公司不承担任何经济和法律责任。",
                           @"6.4本产品尽力提供完整、及时、准确的信息，但不对所提供的信息的完整性、及时性、准确性承担任何责任。",
                           @"6.5本产品全力保障信息的优质传输，但不对因任何原因造成的信息异常或信息传递异常情况所致后果承担任何责任。",
                           @"6.6因不可抗力、政策法规规定、监管机构等政府机关要求、通信链路中段、软件系统/终端设备载体故障、黑客攻击、网络中断、病毒侵害、信息源异常等原因导致本产品无法向您提供本产品或本产品内容发生遗漏、错误、丢失、延迟、中断等情形的，我公司不对此向您承担责任。",
                           @"6.7您深刻理解证券投资的风险，充分认识到本产品仅供您参考使用，不构成您进行投资决策的依据。您自行用于投资决策的依据，我公司不承担任何经济和法律责任。",
                           @"6.8您应妥善保管证券账户、资金账户和相应的密码，不得委托任何第三方（包括我公司和我公司员工）保管账户，代理买卖证券。您不得与任何第三方（包括我公司和我公司员工）另行签订证券投资收益保证、利益共享或者损失分担等协议或达成其他形式的约定，该类协议或约定我公司一律不予认可，给您造成的损失，我公司不予赔偿，您可依法向该等个人追究法律责任。鉴于我公司已做了充分的提示，您确认我公司在此情形发生后得以免责。",
                           @"6.9本产品违反《产品购买协议》及本《风险揭示书》之约定，擅自所做的承诺一律无效，由此导致的不利后果由您自行承担。我公司证券投资顾问人员或其他人员违反本《产品购买协议》及《风险揭示书》之约定，擅自所做的承诺一律无效，由此导致的不利后果由您自行承担。若有人员冒充我公司或者我公司员工的名义与您取得联系，与您签订证券投资收益保证、利益共享或者损失分担等协议或达成其他形式的约定，该类协议或约定我公司一律不予认可，造成您的损失，我公司不予赔偿，您可依法向该等个人追究法律责任。鉴于我公司已做了充分的提示，您确认我公司在此情形发生后得以免责。",
                           @"6.10本产品不承诺或保证收益，您应独立、审慎做出投资决定，由此造成损失的，由您自行承担。",
                           @"7.保密原则",
                           @"7.1一方（“接收方”）同意对其履行本协议过程中所知悉的有关另一方（“披露方”）的保密信息严守秘密。除非为履行本协议项下的工作，接收方不得使用保密信息；未经接收方或有关保密信息的权利人的同意或根据有关法律、法规的规定，不得将该保密信息透露给其他任何第三方。",
                           @"7.2以下信息不属于保密信息：1）有书面证据表明接收方先前已知悉的任何信息；2）非因接收方的过错而进入公共领域或为公众所知晓的信息；3）接收方其后从其他途径合法获得的信息。",
                           @"7.3我公司可将保密信息透露给其相关的雇员或其所聘请的专业人士，但我公司应确保上述人员亦应受本协议的约束，使保密信息处于保密状态，并仅为本协议履行之目的使用该等保密信息。",
                           @"8.违约责任",
                           @"8.1如果我公司有证据证明，您违反了本协议第7条或其他相关条款规定，我公司有权利终止本协议，并不承担违约责任。我公司向您发出通知后，协议终止，我公司无需向您退还任何费用。",
                           @"8.2您同意保障和维护我公司及其他客户的利益，因您违反有关法律法规或协议约定给我公司造成损失的，您必须承担由此造成的损害赔偿责任。",
                           @"9.协议变更与终止",
                           @"9.1自您购买本产品起，本协议生效。本协议有效期内，您随时可以退订本产品，或在协议有效期满时选择不续订本产品，但我公司不退还您已交付的费用。",
                           @"9.2您有下列情形之一的，我公司有权随时解除本协议，并不退还已交费用：1）您有捏造事实或者隐瞒重要情节等情形，致使本产品不能依法提供有效的服务的；2）严重违反法律违规或本协议条款的；3）其他违法违规或违反本协议未能限期改正的行为。",
                           @"9.3本协议有效期与服务期一致。本协议签署后，若有关法律法规、行业自律规则修订，本协议与之不相适应的内容或条款双方有权实施修订。该协议修订前，其违反法律、法规或规则的条款导致一方违法、违规、违约的，另一方同意免除其违约及赔偿等法律责任。",
                           @"9.4若我公司需要修改或增补本协议的，修改或增补内容自动成为协议的有效组成部分。协议未变更的部分效力不变。您继续使用本产品，表示您已充分理解并同意本协议修改或增补条款。",
                           @"10.适用法律与争议解决",
                           @"10.1适用法律：与本协议之订立、解释、履行、争议解决等一切相关事宜，均适用中华人民共和国有关法律、法规及规章。",
                           @"10.2争议解决：因本协议的解释、履行、违约、终止和效力引起的或与之有关的任何争议及主张，应通过友好协商加以解决。如果争议双方在30日内仍不能通过协商解决争议，则协议任一方有权向我公司所在地人民法院提起诉讼。违约方应承担守约方由此支出的必要律师费用和调查取证等费用。"
                           ];
    }
    [self setNormalBackNav];
    
}



- (void)didReceiveMemoryWarning {
    [super didReceiveMemoryWarning];
    
}

/*
#pragma mark - Navigation

// In a storyboard-based application, you will often want to do a little preparation before navigation
- (void)prepareForSegue:(UIStoryboardSegue *)segue sender:(id)sender {
    // Get the new view controller using [segue destinationViewController].
    // Pass the selected object to the new view controller.
}
*/

@end
